{
  "name": "Cyrus Chua",
  "tagline": "Security Engineering @ Gusto",
  "about": "- Seasoned infosec professional with 9+ years of work experience ininfosec/cybersec, with specialized experience/skills in the following security Home My Network Jobs MessagingNotifications Me  For Business Lear 12/16/25, 6:09 PM Cyrus C. | LinkedIn https://www.linkedin.com/in/cyruschua/ 1/8 domains: detection engineering, incident response, digital forensics, threathunting, vulnerability management, corporate security, security risk analysis,security operations, security automation, security analytics, AI security, andsecurity engineering. - I have experience both working in a large organization (>10k employees),implementing with security at scale, as well as smaller/startup environment (2k+employees) where the team is more lean/broad-scoped, allowing me to wearmany hats. - I am currently working full-time as a Senior Security Engineer in the DefenseEngineering and Threat Hunting (DETH) team at Gusto, primarily leading/buildingdetection engineering and vuln management functions, but also building threathunting and sec ops with a focus on scaling and automating. - Previously a member of Paranoids TSR/FIRE team at Yahoo/Verizon Media/Oath,focusing on incident response and automations. - M.S. Security Informatics from Johns Hopkins University and GIAC CertifiedIncident Handler. - I am passionate about always learning and applying my knowledge and skills ininformation security, specifically in the areas of security engineering, threatdetection, vulnerability management, and security analytics. I also have a fairamount of knowledge in applied cryptography, web security, and softwaresecurity. - I feel strongly that security should be something that engineering/productteams have ownership of, and the security team's job should be topartner/assist/collaborate with/empower their efforts in writing secure code andbuilding things safely. Partnerships between IT/eng teams and security are superimportant. P.S. I'm not interested in: contract roles, roles in toxic companies (badly handledlayoffs/RTOs, removing DEI policies, etc.), or roles that require relocating to adifferent country/state. I also don't accept random LinkedIn connection requestsunless I've met and interacted with you either in-person or through a video call.Thank you. Top skillsSecurity Incident Response • Cyber Threat Hunting (CTH) • Threat& Vulnerability Management • Detection Engineering • SecurityEngineering Services Show all services Cybersecurity Featured Post happy to be a part of th 4 12/16/25, 6:09 PM Cyrus C. | LinkedIn https://www.linkedin.com/in/cyruschua/ 2/8",
  "experience": [
    {
      "title": "Senior Security EngineerGusto",
      "company": "Gusto",
      "period": "Nov 2021 - Present",
      "description": "Security Engineering, Detection Engineering and +7 skills What I do:- Security Engineering- Detection Engineering / Detection-as-code- Incident Response- Vulnerability Management- Corporate Security- Threat Hunting- Cloud Security Technical Security Engineer - Forensics, Incident Response,Engineerin..."
    },
    {
      "title": "Security Professional",
      "company": "Security Engineering, Detection Engineering and +7 skills",
      "period": "Aug 2017 - Nov 2021",
      "description": "What I do:- Security Engineering- Detection Engineering / Detection-as-code- Incident Response- Vulnerability Management- Corporate Security- Threat Hunting- Cloud Security Security Engineering, Security Incident Response and +1 skill Member of Forensics, Incident Response, Engineering (FIRE) Team of theVerizon Media / Yahoo (formerly known as Oath) Paranoids> My job scope includes Incident Response, Forensics, and other blue-team related activities.> Transitioned into..."
    },
    {
      "title": "Security Professional",
      "company": "Security Engineering, Security Incident Response and +1 skill",
      "period": "Mar 2017 - Aug 2017",
      "description": "Member of Forensics, Incident Response, Engineering (FIRE) Team of theVerizon Media / Yahoo (formerly known as Oath) Paranoids> My job scope includes Incident Response, Forensics, and other blue-team related activities.> Transitioned into FIRE team at Verizon Media due to Verizon'sacquisition of Yahoo! Inc., and back to Yahoo after the divestiture.> Network/systems monitoring, forensic collection/analysis of digitalevidence> Hunt and investigate possible threats and indicators of compromise,auto"
    },
    {
      "title": "Show all 8 experiences",
      "company": "https://www.linkedin.com/in/cyruschua/ 3/8",
      "period": "Sep 2016 - Dec 2016",
      "description": "Assist Dr. Avi Rubin in the course: Security and Privacy in Computing(EN.600.443). Data Science InternGovTech Singapore (formerly IDA Singapore) · Internship..."
    },
    {
      "title": "Assist Dr. Avi Rubin in the course: Security and Privacy in Computing(EN.600.443).",
      "company": "· 4 mosBaltimore, Maryland",
      "period": "Apr 2015 - Jul 2015",
      "description": "Taxi Trajectory Data Mining and Visualization (Python, XML, OSM,Google API)• Contributed significantly to the early stages of \"Taxi Trajectory DataMining and Visualization\" System used to optimize taxi supply-demandof taxis.• Worked on algorithms for generating graphs of road networks with>90% accur..."
    }
  ],
  "education": [],
  "skills": [
    "Prompt Engineering",
    "Computer ForensicsEN.600.457",
    "Recommendations",
    "Courses",
    "Given"
  ],
  "contact": {}
}